# FAP-YOLO11s — s-scale copy of cfg/fap-yolo11n.yaml (ultralytics picks the scale from
# the "11s" filename suffix). This file uses the TRUE stock YOLO11 scale convention
# (channels written at max width, scaled down), so s is the stock [0.50, 0.50, 1024].
# Layer indices (0-28) are unchanged vs the n file, so configs/fap.yaml's
# protected_layers still line up if this variant is ever pruned.
# See cfg/fap-yolo11n.yaml for the FreqMix / P2-head rationale.
# Requires models.fap.register_fap() — done automatically via --idea fap.

nc: 10 # VisDrone classes

scales: # [depth, width, max_channels] -- true stock YOLO11 convention (not lwso's direct-n)
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024] # picked via the 11s filename suffix

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0  P1/2
  - [-1, 1, FreqMix, [128]] # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2  P2 feature
  - [-1, 1, FreqMix, [256]] # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4  P3 feature
  - [-1, 1, FreqMix, [512]] # 5  P4/16
  - [-1, 2, C3k2, [512, True]] # 6  P4 feature
  - [-1, 1, FreqMix, [1024]] # 7  P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10 P5 feature

head:
  # top-down: P5 -> P4 -> P3 -> P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12 cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13 P4 top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15 cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 P3 top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 2], 1, Concat, [1]] # 18 cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 19 P2 out (protected)
  # bottom-up: P2 -> P3 -> P4 -> P5
  - [-1, 1, FreqMix, [256]] # 20 P2 -> P3 (protected)
  - [[-1, 16], 1, Concat, [1]] # 21 cat P3 top-down (protected)
  - [-1, 2, C3k2, [256, False]] # 22 P3 out (protected)
  - [-1, 1, FreqMix, [512]] # 23 P3 -> P4
  - [[-1, 13], 1, Concat, [1]] # 24 cat P4 top-down
  - [-1, 2, C3k2, [512, False]] # 25 P4 out
  - [-1, 1, FreqMix, [1024]] # 26 P4 -> P5
  - [[-1, 10], 1, Concat, [1]] # 27 cat P5 feature
  - [-1, 2, C3k2, [1024, True]] # 28 P5 out

  - [[19, 22, 25, 28], 1, Detect, [nc]] # 29 Detect(P2, P3, P4, P5)
