# FAP-YOLO11n — FreqMix downsampling on a stock YOLO11n backbone/neck, P2 head ADDED
# (unlike lwso-yolo11n.yaml, P3/P4/P5 are KEPT — this ports FAP-YOLO12n's representation
# stage, Sec 4.1, where P4/P5 stay in the network and get compressed by pruning later
# (prune.py) instead of being removed architecturally).
#
# Changes vs stock yolo11.yaml:
#   * every backbone/neck stride-2 downsample Conv -> FreqMix (Haar band decompose +
#     learnable softmax mixing + 1x1 proj; see models/fap/modules.py)
#   * P2 (stride-4) detect head added via a full top-down + bottom-up extension of the
#     neck (mirrors the well-known community "P2" YOLO neck pattern) -> 4 detect scales
#     P2/P3/P4/P5 instead of 3
#
# Requires models.fap.register_fap() before YOLO(<this file>) — done automatically by
# models.fap.FAPModel when training via --idea fap.
#
# Layer indices below (0-28) matter beyond just this file: configs/fap.yaml's
# `protected_layers` references them for prune.py's semantic-path-aware pruning
# (Sec 4.2) -- protects the P1->P2->P3 backbone chain (0-4) and the P2 top-down/out +
# P2->P3 bottom-up head layers (17-22) from aggressive LAMP pruning. If you edit this
# file's layer order/count, update configs/fap.yaml's protected_layers to match.

nc: 10 # VisDrone classes

scales: # [depth, width, max_channels] -- true stock YOLO11n scale (not lwso's direct-n convention)
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0  P1/2
  - [-1, 1, FreqMix, [128]] # 1  P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2  P2 feature
  - [-1, 1, FreqMix, [256]] # 3  P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4  P3 feature
  - [-1, 1, FreqMix, [512]] # 5  P4/16
  - [-1, 2, C3k2, [512, True]] # 6  P4 feature
  - [-1, 1, FreqMix, [1024]] # 7  P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10 P5 feature

head:
  # top-down: P5 -> P4 -> P3 -> P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12 cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13 P4 top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15 cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 P3 top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 2], 1, Concat, [1]] # 18 cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 19 P2 out (protected)
  # bottom-up: P2 -> P3 -> P4 -> P5
  - [-1, 1, FreqMix, [256]] # 20 P2 -> P3 (protected)
  - [[-1, 16], 1, Concat, [1]] # 21 cat P3 top-down (protected)
  - [-1, 2, C3k2, [256, False]] # 22 P3 out (protected)
  - [-1, 1, FreqMix, [512]] # 23 P3 -> P4
  - [[-1, 13], 1, Concat, [1]] # 24 cat P4 top-down
  - [-1, 2, C3k2, [512, False]] # 25 P4 out
  - [-1, 1, FreqMix, [1024]] # 26 P4 -> P5
  - [[-1, 10], 1, Concat, [1]] # 27 cat P5 feature
  - [-1, 2, C3k2, [1024, True]] # 28 P5 out

  - [[19, 22, 25, 28], 1, Detect, [nc]] # 29 Detect(P2, P3, P4, P5)
