# LWSO-YOLO11-eff — compute-efficient variant of lwso-yolo11n.yaml, targeting both lower
# GFLOPs AND higher small-object mAP (not just a compute trim like lwso-yolo11n-lite.yaml).
#
# What changed vs lwso-yolo11n.yaml (2 edits, same idea/topology, nothing removed):
#   1. SPDConv -> SPDConvGroup (grouped fusion conv, 8 groups) at all 5 downsample spots.
#      Measured: lwso-yolo11n.yaml is 2.40M params / 21.49 GFLOPs@640; swapping just this
#      gets it to 0.96M params / 12.41 GFLOPs@640 -- SPDConv's dense fusion conv (over all
#      4*c1 channels) is the single largest compute driver in the full model, bigger than
#      C3k2Ghost's savings. Grouping recovers most of that cost while keeping the lossless
#      space-to-depth rearrange everywhere (unlike -lite.yaml, which drops SPDConv at 4/5
#      spots to save compute). This mirrors LRDS-YOLO's LAD downsample module (grouped conv
#      + lightweight gating), whose own ablation showed a similar swap *improving* mAP50
#      slightly (+1.0) rather than costing accuracy -- unlike a blind channel/topology cut.
#   2. Added ECA (near-zero cost channel attention) right after the P2 output (backbone had
#      EMA on P3 already; P2 -- where small objects actually live -- had no attention at
#      all). Spends part of the GFLOPs saved by (1) on the one spot most likely to move
#      small-object mAP, instead of leaving 100% of the savings on the table.
#
# GhostBottleneck (C3k2Ghost) is left as-is: already measured at -20% GFLOPs vs stock C3k2
# with no known accuracy cost, and literature comparisons show PConv (a candidate swap)
# trading accuracy for latency rather than clearly beating Ghost -- not swapped here.
#
# Still requires models.lwso.register_lwso() (done automatically via --idea lwso).
# Not yet accuracy-validated -- train alongside lwso-yolo11n.yaml (and -lite.yaml) and
# compare mAP before picking one as default.

nc: 10 # VisDrone classes

scales: # [depth, width, max_channels]
  n: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]                    (shapes @ 960x960 input, n scale)
  - [-1, 1, Conv, [16, 3, 2]] # 0  P1/2   16x480x480
  - [-1, 1, SPDConvGroup, [32]] # 1  P2/4   32x240x240
  - [-1, 2, C3k2Ghost, [64, False, 0.25]] # 2         64x240x240
  - [-1, 1, SPDConvGroup, [64]] # 3  P3/8   64x120x120
  - [-1, 2, C3k2Ghost, [128, False, 0.25]] # 4        128x120x120
  - [-1, 1, EMA, [128]] # 5         128x120x120
  - [-1, 1, SPDConvGroup, [128]] # 6  P4/16  128x60x60
  - [-1, 2, C3k2Ghost, [128, True]] # 7               128x60x60
  - [-1, 1, SPPF, [128, 5]] # 8               128x60x60
  - [-1, 1, C2PSA, [128]] # 9               128x60x60

head:
  # top-down
  - [-1, 1, DySample, [128, 2]] # 10 P4 -> P3 size
  - [[-1, 5], 1, BiFPNCat, [2]] # 11 128+128=256
  - [-1, 1, C3k2Ghost, [128, False]] # 12 P3 intermediate
  - [-1, 1, DySample, [128, 2]] # 13 P3 -> P2 size
  - [[-1, 2], 1, BiFPNCat, [2]] # 14 128+64=192
  - [-1, 1, C3k2Ghost, [64, False]] # 15 P2/4 out (64x240x240)
  - [-1, 1, ECA, [64]] # 16 cheap channel attention on P2 (small-object features)
  # bottom-up
  - [-1, 1, SPDConvGroup, [128]] # 17 P2 -> P3 size
  - [[-1, 12], 1, BiFPNCat, [2]] # 18 128+128=256
  - [-1, 1, C3k2Ghost, [128, False]] # 19 P3/8 out
  - [-1, 1, SPDConvGroup, [128]] # 20 P3 -> P4 size
  - [[-1, 9], 1, BiFPNCat, [2]] # 21 128+128=256
  - [-1, 1, C3k2Ghost, [128, True]] # 22 P4/16 out

  - [[16, 19, 22], 1, Detect, [nc]] # 23 Detect(P2, P3, P4) -- P2 tap is post-ECA
