# STAR-YOLO11n v3 — StarNet backbone + GSConv slim-neck + SimAM + Wise-IoU v3, tuned to land
# close to fap-yolo11n.yaml's GFLOPs (8.96@640, the cheapest P2-having architecture measured in
# this repo) despite having 1 fewer detect scale (P2/P3/P4, no P5) and StarBlock/GSConv on top.
# Iteration history (each measured via a real build, not guessed):
#   v1 (SPDConvGroup downsample, StarBlock/GSConv everywhere incl. P2, full-width neck):
#      1.08M params, 13.67 GFLOPs@640 -- heavier than fap-yolo11n.yaml despite fap having a
#      4th detect scale (P5) this file doesn't.
#   v2 (FreqMix downsample instead of SPDConvGroup, StarBlock/GSConv only at P3/P4, stock C3k2
#      at P2, still full-width neck): 0.876M params, 12.16 GFLOPs@640 -- better, still 3.2
#      GFLOPs above fap. Isolating variables (measured, not assumed) ruled out DySample/
#      BiFPNCat/SimAM (near-zero cost either way) and ruled out C3k2Star/VoVGSCSP being
#      *heavier* than stock C3k2 (they're lighter, per tests/test_modules.py). Also ruled out
#      "P5 was cheap to keep" -- re-adding P5 with StarBlock throughout made things *worse*
#      (13.26 GFLOPs, 2.17M params) because the extra top-down/bottom-up P5 processing cost
#      more than SPPF/C2PSA saved by moving to the cheaper P5 resolution.
#   v3 (this file): matched fap-yolo11n.yaml's neck channel counts exactly instead of keeping
#      full backbone width through the neck -- fap's neck thins aggressively at the expensive
#      P2/P3 resolutions (its P2 output is 32ch vs its own P2 backbone feature's 64ch, P3
#      top-down is 64ch vs P3 backbone's 128ch) while v1/v2 of this file kept full width (64ch
#      P2, 128ch P3) all the way through the neck. This was the dominant cost driver, not the
#      custom modules: 0.647M params, 7.60 GFLOPs@640 -- *below* fap-yolo11n.yaml's 8.96 despite
#      fap having 4 detect scales vs this file's 3.
#
# Design (v3, final):
#   * Downsample: FreqMix (models/fap/modules.py) throughout -- cheaper than SPDConvGroup for
#     P2-having architectures (see v1/v2 numbers above).
#   * P2 backbone/neck blocks: stock C3k2 (not C3k2Star/VoVGSCSP) -- cheapest possible at the
#     most expensive resolution in the network (4x the pixels of P3, 16x of P4).
#   * P3/P4 backbone/neck blocks: C3k2Star (StarNet element-wise-multiply blocks, reparam
#     RepConv spatial-mix, arXiv:2403.19967) / VoVGSCSP (GSConv-based CSP, arXiv:2206.02424)
#     -- affordable here, still deliver the idea's core value-add.
#   * Neck channel counts thinned to match fap-yolo11n.yaml's proven-efficient ratio (roughly
#     half the backbone feature width at P2/P3) rather than carrying full backbone width
#     through every neck node.
#   * SimAM (0 nn.Parameter) at the P2 output -- essentially free regardless of resolution.
#   * Wise-IoU v3 loss (models/star/losses.py) -- 0 GFLOPs cost, pure loss function swap.
#
# Requires models.star.register_star() before YOLO(<this file>) -- done automatically via
# --idea star (register_star() calls register_lwso() for DySample/BiFPNCat and register_fap()
# for FreqMix, both reused unchanged from their respective idea packages).
#
# Measured (real build+forward): 0.647M params, 7.60 GFLOPs@640, strides [4,8,16]. mAP not yet
# accuracy-validated -- needs a real training run to compare against fap-yolo11n.yaml/
# lwso-yolo11n-eff.yaml (thinner neck channels are a real capacity trade-off, not free -- this
# needs confirming on real data, same as every other cfg/*.yaml in this repo).

nc: 10 # VisDrone classes

scales: # [depth, width, max_channels]
  n: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]              (shapes @ 640x640 input, matching fap-yolo11n.yaml's scaled channels)
  - [-1, 1, Conv, [16, 3, 2]] # 0  P1/2   16x320x320
  - [-1, 1, FreqMix, [32]] # 1  P2/4     32x160x160
  - [-1, 1, C3k2, [64, False, 0.25]] # 2  P2 feature (stock -- cheapest at this resolution) 64x160x160
  - [-1, 1, FreqMix, [64]] # 3  P3/8     64x80x80
  - [-1, 1, C3k2Star, [128, False, 0.25]] # 4  P3 feature (StarBlock, affordable here) 128x80x80
  - [-1, 1, FreqMix, [128]] # 5  P4/16    128x40x40
  - [-1, 1, C3k2Star, [128, True]] # 6  P4 feature 128x40x40
  - [-1, 1, SPPF, [128, 5]] # 7          128x40x40
  - [-1, 1, C2PSA, [128]] # 8          128x40x40

head:
  # top-down (neck channels thinned to match fap-yolo11n.yaml's proven ratio, not full backbone width)
  - [-1, 1, DySample, [128, 2]] # 9  P4 -> P3 size
  - [[-1, 4], 1, BiFPNCat, [2]] # 10 128+128=256
  - [-1, 1, VoVGSCSP, [64, False]] # 11 P3 top-down (thinned: 256 -> 64, not 128)
  - [-1, 1, DySample, [64, 2]] # 12 P3 -> P2 size
  - [[-1, 2], 1, BiFPNCat, [2]] # 13 64+64=128
  - [-1, 1, C3k2, [32, False]] # 14 P2/4 out (stock, thinned: 128 -> 32, not 64)
  - [-1, 1, SimAM, [32]] # 15 parameter-free attention on P2 (small-object features), ~free
  # bottom-up
  - [-1, 1, FreqMix, [64]] # 16 P2 -> P3 size
  - [[-1, 11], 1, BiFPNCat, [2]] # 17 64+64=128
  - [-1, 1, VoVGSCSP, [64, False]] # 18 P3/8 out
  - [-1, 1, FreqMix, [128]] # 19 P3 -> P4 size
  - [[-1, 8], 1, BiFPNCat, [2]] # 20 128+128=256
  - [-1, 1, VoVGSCSP, [128, True]] # 21 P4/16 out

  - [[15, 18, 21], 1, Detect, [nc]] # 22 Detect(P2, P3, P4) -- P2 tap is post-SimAM
